[
    {
        "mode": "CAMPAGNE PHYSIQUE",
        "title": "Mode de jeu - Campagne Physique",
        "content": "Le mode Campagne Physique est conçu pour accompagner les tables de jeu qui se réunissent en présentiel, tout en bénéficiant d’une persistance complète des données entre les sessions.\n\nDans ce mode, chaque participant - joueurs comme Maître du Jeu - doit disposer d’un compte et se connecter afin de rejoindre l’instance de campagne créée.\n\nUne fois connecté, chaque joueur retrouve dans son profil une section « Campagne en cours ».\nDepuis cet espace, il accède à toutes les informations essentielles de son personnage :\n\nPseudo\n\nRace\n\nClasse\n\nStatistiques\n\nÉquipement\n\nRessources (PV, Mana, Or, etc.)\n\nLe Maître du Jeu dispose d’une vue globale enrichie, incluant :\n\nSynopsis de la campagne\n\nRésumé narratif\n\nDernier récit / dernière action avant la fin de session\n\nÉtat des combats en cours\n\nMonstres actifs et leurs statistiques\n\nStatistiques complètes de tous les personnages\n\nDans ce mode, le MJ est le seul à pouvoir modifier les données après les actions effectuées autour de la table :\n\nPoints de vie\n\nMana\n\nOr\n\nStatistiques diverses\n\nÉtats (blessé, inconscient, etc.)\n\nL’objectif est simple :\n Conserver une mémoire fidèle de la campagne\n Permettre une reprise rapide et fluide lors de la prochaine session physique\n Éviter les pertes d’informations entre deux rencontres\n\nC’est un support numérique discret, pensé pour enrichir - sans remplacer - l’expérience papier autour de la table."
    },

    {
        "mode": "CAMPAGNE EN LIGNE",
        "title": "Mode de jeu - Campagne en Ligne",
        "content": "Le mode Campagne en Ligne propose une expérience complète, pensée pour jouer à distance avec toutes les fonctionnalités nécessaires intégrées au SaaS.\n\nCréation et gestion de campagne\n\nUn utilisateur crée la campagne en se déclarant Maître du Jeu.\nLes autres participants peuvent ensuite :\n\nRejoindre la campagne via invitation / code\n\nCréer leur personnage\n\nL’affilier exclusivement à cette campagne\n\nChaque personnage est donc lié à son instance de jeu.\n\nFonctionnalités joueurs\n\nLes joueurs disposent de :\n\nFiche personnage complète\n\nStatistiques en temps réel\n\nGestion des ressources (PV, Mana, Or…)\n\nInventaire\n\nÉtats et effets\n\nUn système de lancer de dés est intégré, incluant notamment :\n\n Lancer de D20 en ligne\n\nRésultats synchronisés pour tous les participants\n\nHistorique des jets\n\n(L’interface 3D du dé peut être propulsée via Three.js.)\n\nPouvoirs du Maître du Jeu\n\nLe MJ conserve un rôle central de supervision et de contrôle :\n\nModifier les statistiques joueurs\n\nGestion des combats\n\nApparition / suppression de monstres\n\nAjustement des ressources\n\nNarration et suivi du récit\n\nIl peut également clore une session de jeu à tout moment.\n\nGestion de la mort des personnages\n\nEn cas de mort d’un joueur :\n\nLe MJ peut autoriser la création d’un nouveau personnage\n\nOu décider de ne pas lui redonner de rôle actif\n\nDans ce second cas, le joueur reste présent dans la campagne en mode observateur :\n\nAccès à la session en cours\n\nSuivi des statistiques globales\n\nÉcoute du récit (via Discord ou autre outil vocal externe)\n\nObjectif du mode en ligne\n\nOffrir une expérience D&D jouable entièrement à distance\n\nCentraliser toutes les mécaniques de jeu\n\nMaintenir la synchronisation des données en temps réel\n\nDonner au MJ un contrôle total sur le déroulement de la campagne."
    }
]